Stress Tests/stressTest_uploadProblemLight200/test_upload_light.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">200</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">3001</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/login</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;username&quot;: &quot;admin&quot;,&#xd;
  &quot;password&quot;: &quot;1234&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="new problem">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">3001</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/newProblem</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;problemName&quot;: &quot;problem${__counter(false)}&quot;,&#xd;
  &quot;problemTypeId&quot;: 1,&#xd;
  &quot;parameters&quot;: [&#xd;
    {&#xd;
      &quot;parameterId&quot;: 1,&#xd;
      &quot;value&quot;: &quot;${locations}&quot;&#xd;
    },&#xd;
    { &quot;parameterId&quot;: 2, &quot;value&quot;: 1 },&#xd;
    { &quot;parameterId&quot;: 3, &quot;value&quot;: 0 },&#xd;
    { &quot;parameterId&quot;: 4, &quot;value&quot;: 1000000000000 }&#xd;
  ]&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="locations" elementType="Argument">
                <stringProp name="Argument.name">locations</stringProp>
                <stringProp name="Argument.value">{ \&quot;Locations\&quot;: [ { \&quot;Latitude\&quot;: 47.99983328183838, \&quot;Longitude\&quot;: 23.74317714798427 }, { \&quot;Latitude\&quot;: 37.966783510525985, \&quot;Longitude\&quot;: 23.778605533642235 }, { \&quot;Latitude\&quot;: 37.9990464764814, \&quot;Longitude\&quot;: 23.773251398190194 }, { \&quot;Latitude\&quot;: 37.974070236340665, \&quot;Longitude\&quot;: 23.737519890565082 }, { \&quot;Latitude\&quot;: 37.99763705556787, \&quot;Longitude\&quot;: 23.76632669971703 }, { \&quot;Latitude\&quot;: 37.987158185269436, \&quot;Longitude\&quot;: 23.760040398809927 }, { \&quot;Latitude\&quot;: 37.96565952612894, \&quot;Longitude\&quot;: 23.78044816563277 }, { \&quot;Latitude\&quot;: 38.00816194011881, \&quot;Longitude\&quot;: 23.743726736188382 }, { \&quot;Latitude\&quot;: 37.983474656462256, \&quot;Longitude\&quot;: 23.73256864917707 }, { \&quot;Latitude\&quot;: 37.96362413346355, \&quot;Longitude\&quot;: 23.77785820154608 }, { \&quot;Latitude\&quot;: 37.96581060070882, \&quot;Longitude\&quot;: 23.72133687257313 }, { \&quot;Latitude\&quot;: 37.97624293546459, \&quot;Longitude\&quot;: 23.740238201740137 }, { \&quot;Latitude\&quot;: 38.00566809733227, \&quot;Longitude\&quot;: 23.728089082692076 }, { \&quot;Latitude\&quot;: 38.00132387722171, \&quot;Longitude\&quot;: 23.75830400972441 }, { \&quot;Latitude\&quot;: 37.96320247915091, \&quot;Longitude\&quot;: 23.785174964462342 }, { \&quot;Latitude\&quot;: 37.965357705819066, \&quot;Longitude\&quot;: 23.74320004992697 }, { \&quot;Latitude\&quot;: 37.9692186084866, \&quot;Longitude\&quot;: 23.785110852487332 }, { \&quot;Latitude\&quot;: 37.98271697637991, \&quot;Longitude\&quot;: 23.73542153051244 }, { \&quot;Latitude\&quot;: 37.97230013076112, \&quot;Longitude\&quot;: 23.788423933330492 }, { \&quot;Latitude\&quot;: 37.97827880279073, \&quot;Longitude\&quot;: 23.75884558944574 } ] }</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </Arguments>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">test_upload_light200.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug Sampler" enabled="true">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>