Stress Tests/stressTest_uploadProblemLight200/summary_light_200.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Login,200,102,83,228,"21,24","0,000%","39,26959","21,26","8,59","554,4"
new problem,200,32,18,188,"26,80","0,000%","40,93328","643,14","98,59","16089,0"
Debug Sampler,200,0,0,1,"0,23","0,000%","42,26543","79,92","0,00","1936,3"
TOTAL,600,45,0,228,"47,15","0,000%","117,27912","709,31","102,71","6193,2"